DataProcessors/EDR_ЧтениеGAREXP.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<DataProcessor>
		<Properties>
			<Name>EDR_ЧтениеGAREXP</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПутьКфайлу</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ТаблицаСчетов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>НомерСчета</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>6</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КатегорияСчета</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>1</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Автомобиль</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Автомобили</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Валюта</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтавкаНДС</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаБезНДС</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНДС</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаДокумента</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерВДМС</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗаказНаряд</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ЗаказНаряд</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

InformationRegisters/EDR_Invoices.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>EDR_Invoices</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Категория</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.EDR_КатегорииСчетов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаИнвойса</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Expense_code</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.EDR_ВидыРасходов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ЗаказНаряд</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказНаряд</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Invoice</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>6</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>GUID</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СчетФактура</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.СчетФактураВыданный</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

DataProcessors/EDR_ЧтениеGAREXP/Ext/ObjectModule.bsl
Процедура ОбработкаНаСервере() Экспорт
	СчитатьФайл();
КонецПроцедуры
	
//Продумать вариант хранения данных в системе.
Процедура СчитатьФайл() Экспорт
	
	ТаблицаСчетов.Очистить();
	
	ТекстФайла = Новый ТекстовыйДокумент;
	ТекстФайла.Прочитать(ПутьКфайлу);
	
	КоличествоСтрок = ТекстФайла.КоличествоСтрок();
	Для Сч = 1 по КоличествоСтрок Цикл
		ТекСтрока = ТекстФайла.ПолучитьСтроку(Сч);
		Если Лев(ТекСтрока,3) = "015" тогда
			СтруктураСчета = Новый Структура;
			СтруктураСчета.Вставить("НомерСчета",Сред(ТекСтрока,5,6));
			СтруктураСчета.Вставить("КатегорияСчета",Сред(ТекСтрока,12,1));
			СтруктураСчета.Вставить("Автомобиль",Справочники.Автомобили.НайтиПоРеквизиту("VIN",Сред(ТекСтрока,19,17)));
			СтруктураСчета.Вставить("Валюта", Справочники.Валюты.НайтиПоРеквизиту("КодВалютыПоISO",ВРег(Сред(ТекСтрока,36,3))));
			СтруктураСчета.Вставить("СтавкаНДС", Справочники.СтавкиНДС.НайтиПоРеквизиту("Ставка",Число(Сред(ТекСтрока,119,5))/100));
			СтруктураСчета.Вставить("СуммаНДС", Число(Сред(ТекСтрока,142,15))/100);
			СтруктураСчета.Вставить("СуммаБезНДС", Число(Сред(ТекСтрока,40,15))/100);
			СтруктураСчета.Вставить("СуммаДокумента", Число(Сред(ТекСтрока,126,15))/100);
			СтруктураСчета.Вставить("НомерВДМС", Сред(ТекСтрока,174,20));
			
			ЗаказНаряд = РегистрыСведений.EDR_Invoices.ПолучитьЗаказНарядПоСчету(СтруктураСчета["НомерСчета"]);
			СтруктураСчета.Вставить("ЗаказНаряд",ЗаказНаряд);
			
			НС = ТаблицаСчетов.Добавить();
			ЗаполнитьЗначенияСвойств(НС,СтруктураСчета);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры
